.doom.d/config.org
#+TITLE: Literate config

* User variables
** Name and email
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Sonny Jansson")
(setq user-mail-address "sonnyjansson01@gmail.com")
#+END_SRC
* General emacs config
** Emacs server
*** Start server
#+BEGIN_SRC emacs-lisp
(server-start)
#+END_SRC
** Keybinds
*** (Leader - DEL) Switch to last buffer
#+BEGIN_SRC emacs-lisp
(map! :leader :desc "Switch to last buffer" "DEL" #'evil-switch-to-windows-last-buffer)
#+END_SRC

*** (Leader - SPC) M-x
#+BEGIN_SRC emacs-lisp
(map! :leader :desc "M-x" "SPC" #'counsel-M-x)
#+END_SRC

*** (Leader - :) Find file in project
#+BEGIN_SRC emacs-lisp
(map! :leader :desc "Find file in project" ":" #'+ivy/projectile-find-file)
#+END_SRC

* Language support
** File extension mode auto-load
#+BEGIN_SRC emacs-lisp
; (add-to-list 'auto-mode-alist '("\\.elm\\'" . elm-mode))
#+END_SRC_
* Org mode
** Basic org settings
#+BEGIN_SRC emacs-lisp
(setq org-directory "~/org/")
(setq org-projects (concat org-directory "Projects/"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '(org-directory org-projects))
#+END_SRC
** Org-drill
#+BEGIN_SRC emacs_lisp
(use-package! org-drill)
#+END_SRC
** Org capture
#+BEGIN_SRC emacs-lisp
(setq org-default-notes-file (concat org-directory "inbox.org"))
#+END_SRC
*** Templates

This snippet is used for constructing a completion table string that can be used
in an org capture template to give a choice between different project files.
#+BEGIN_SRC emacs-lisp
(defun all-project-files ()
  "Returns a list of all project files"
    (interactive)
    (directory-files org-projects nil "\\.org$"))

(defun project-files-to-choices ()
  "Make choice string out of project files"
  (let (
    (prepend-all (lambda (x xs) (if xs (concat (concat x (car xs)) (funcall prepend-all x (cdr xs))) ""))))
    (concat "%^{Project" (funcall prepend-all "|" (all-project-files)) "}")))
#+END_SRC

My captures templates are as such:
 - Project idea
   - Captures an idea that I have for a specific project
#+BEGIN_SRC emacs-lisp
(setq org-capture-templates
      '(("p" "Project idea" entry (file+headline "inbox.org" "Projects")
         "* Project idea: %(project-files-to-choices)")))
#+END_SRC
